总数量：{dr_count($value)}
==============循环遍历显示 - 开始=============
&lt;?php if ($value) { foreach ($value as $c) { ?>
    序号: {$i}
    文件原始地址：{dr_get_file($c)}
    文件的下载地址：{dr_down_file($c)}
    图片缩略图：{dr_thumb($c, 200, 200)}
    图片缩略图带水印：{dr_thumb($c, 200, 200, 1)}
    缩略图从中间开始剪切，高度宽度固定：{dr_thumb($c, 100, 100, 0, 'crop')}
    对url地址进行缩略处理：{dr_thumb($c, 100, 100, 0, '', 1)}
&lt;?php } } ?>
==============循环遍历显示 - 完毕=============

==============只显示第一个图片=============
{php $c = $value[0];}
文件原始地址：{dr_get_file($c)}
文件的下载地址：{dr_down_file($c)}
图片缩略图：{dr_thumb($c, 200, 200)}